uhnp/src/Catalogs/МониторыКлючевыхПоказателей/МониторыКлючевыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МониторыКлючевыхПоказателей</name>
  <basedOn>Catalog.Запросы</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВВидеСхемы</name>
    <comment>Отображать монитор в виде графической схемы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЦели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаМонитора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиДанных</name>
    <attributes>
      <name>НаборДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючИсточника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИсточникаДанных</name>
      <type>
        <types>EnumRef.ТипыИсточниковДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИсточника</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>CatalogRef.МониторыКлючевыхПоказателей</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СохраненнаяНастройка</name>
      <comment>(для отчетов на базе типового)</comment>
      <type>
        <types>CatalogRef.СохраненныеНастройки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНастройкиОтчета</name>
      <comment>(для отчетов на базе универсального)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательНастройкиОтчета</name>
      <comment>(для отчетов на базе универсального)</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИсточника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ПоказателиМонитораКлючевыхПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиИсточникаДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешняяИБ</name>
      <type>
        <types>CatalogRef.ВнешниеИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыИсточников</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИсточниковДанных</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючИсточника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/МониторыКлючевыхПоказателей/Forms/ФормаНастройкиМКП/Module.bsl
Перем ОбъектОснование;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	
КонецПроцедуры


&НаКлиенте
Процедура ДоступностьЭлементаНастройкиВывода()
	
	Элементы.ОтображатьВВидеСхемы.Доступность = Объект.ОтображатьЦели;
	Если Объект.ОтображатьВВидеСхемы И НЕ Объект.ОтображатьЦели Тогда		
		Объект.ОтображатьВВидеСхемы = Ложь;		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	Если Параметры.Ключ.Пустая() ИЛИ Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработатьЗаписьОтчета", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Для продолжения нужно записать изменения в отчете. Записать?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОтчета(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    Если НЕ Записать() Тогда
        ОбщегоНазначенияУХ.СообщитьОбОшибке(Нстр("ru = 'Не удалось записать отчет'"));
        Возврат;
    КонецЕсли;
        
    ОткрытьФормуОтчета();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета()
	
	ПараметрыФормы = Новый Структура("Монитор, ФормироватьПриОткрытии", Параметры.Ключ, Истина);
	ОткрытьФорму("Справочник.МониторыКлючевыхПоказателей.Форма.ФормаПроизвольногоОтчетаПоМКП", ПараметрыФормы);
					
КонецПроцедуры


&НаКлиенте
Процедура ОтображатьЦелиПриИзменении(Элемент)
	
	ДоступностьЭлементаНастройкиВывода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступностьЭлементаНастройкиВывода();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРассылкиПоРасписанию(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда	
		Оповещение = Новый ОписаниеОповещения("Рассылка_ВопросСохранитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Записать изменения ?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе	
		ЗначениеОтбора = Новый Структура("РассылаемыйОбъект", Объект.Ссылка);
		ПараметрыВыбора_ = Новый Структура("Отбор", ЗначениеОтбора);		
		ОткрытьФорму("Справочник.АналитическаяПодписка.ФормаСписка",ПараметрыВыбора_,ЭтаФорма,Истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассылка_ВопросСохранитьЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Записать();
		
		ЗначениеОтбора = Новый Структура("РассылаемыйОбъект", Объект.Ссылка);
		ПараметрыВыбора_ = Новый Структура("Отбор", ЗначениеОтбора);
		
		ОткрытьФорму("Справочник.АналитическаяПодписка.ФормаСписка",ПараметрыВыбора_,ЭтаФорма,Истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
		
КонецПроцедуры
